# ETL Netflix

In [7]:
import pandas as pd
import sqlalchemy as db
from sqlalchemy import text

In [11]:
# El motor de BD para conectarnos a Mysql
# Va a almacenar la configuracion en una cadena de conexion
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/db_movies_netflix_transact")

conn = engine.connect()

# Cargamos la Dimension Movies

In [13]:
query = '''
SELECT 
    movie.movieID as movieID, movie.movieTitle as title, movie.releaseDate as releaseDate, 
    gender.name as gender , person.name as participantName, participant.participantRole as roleparticipant 
FROM movie 
INNER JOIN participant 
    ON movie.movieID=participant.movieID
INNER JOIN person
    ON person.personID = participant.personID
INNER JOIN movie_gender 
    ON movie.movieID = movie_gender.movieID
INNER JOIN gender 
    ON movie_gender.genderID = gender.genderID
'''

In [ ]:
# Obtener la data de movies
movies_data = pd.read_sql(query, con = conn)

# Convertir una columna a entero
movies_data['movieID'] = movies_data['movieID'].astype('int')

movies_data

,movieID,title,releaseDate,gender,participantName,roleparticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director

In [17]:
# leer otra fuente ( csv )
movies_awards = pd.read_csv('./data/Awards_movie.csv')

# Convertir una columna a entero
movies_awards['movieID'] = movies_awards['movieID'].astype('int')

# renombrar Aware por Award
movies_awards.rename(columns={"Aware": "Awards"}, inplace=True)

movies_awards

    movieID  IdAward  Awards
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [18]:
# Cruzar las movies con Awards
movie_data = pd.merge(movies_data, 
                      movies_awards,
                      left_on= 'movieID',
                      right_on= 'movieID'
)

movie_data

,movieID,title,releaseDate,gender,participantName,roleparticipant,IdAward,Awards
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,1,Grammy

In [19]:
# El motor de BD para conectarnos a Mysql
# Va a almacenar la configuracion en una cadena de conexion
engine_dw = db.create_engine("mysql://root:root@127.0.0.1:3310/dw_netflix")

conn_dw = engine_dw.connect()

In [24]:
movie_data = movie_data.rename(columns={"releaseDate":"releaseMovie","Awards":"AwardMovie"})

In [26]:
movie_data = movie_data.drop(columns=['IdAward'])
movie_data

,movieID,title,releaseMovie,gender,participantName,roleparticipant,AwardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [27]:
movie_data.to_sql('dimMovie', conn, if_exists='append', index=False)

3

In [28]:
moview_load = pd.read_sql('dimMovie', con=conn)
moview_load

,movieID,title,releaseMovie,gender,participantName,roleparticipant,AwardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

# Cargamos la Dimension Users

In [33]:
# Conexion a la Dimension usuario
users = pd.read_csv('./data/users.csv', sep='|')

# Renombrarlo el campo idUser
users.rename(columns={'idUser':'userID'}, inplace=True)

users.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [35]:
users.to_sql('dimUser', conn, if_exists='append', index=False)

20

In [38]:
users_load = pd.read_sql('dimUser', conn)

users_load

      userID     username      country subscription
0    1002331      user123          USA      Premium
1    1002332  gamerGirl97       Canada        Basic
2    1002333   techMaster           UK      Premium
3    1002334    soccerFan       Brazil        Basic
4    1002335    travelBug    Australia      Premium
5    1002336   musicLover       France        Basic
6    1002337     foodie88        Italy      Premium
7    1002338   bookWorm23      Germany        Basic
8    1002339  fitnessJunk       Mexico      Premium
9   10023310    movieBuff        Japan        Basic
10  10023311  artAficiona        Spain      Premium
11  10023312   petLover99  Netherlands        Basic
12  10023313  fashionista   SouthKorea      Premium
13  10023314  codingNinja        India        Basic
14  10023315  natureLover       Norway      Premium
15  10023316  coffeeAddct     Colombia        Basic
16  10023317     beachBum      Bahamas      Premium
17  10023318  skiEnthusst  Switzerland        Basic
18  10023319     homeChef   NewZealand      Premium
19  10023320   yogiMaster     Thailand        Basic

# Cargamos la Tabla Echos

In [40]:
# Extraer una serie de usuarios
user_id = users['userID']
# Extrae una serie de movies
moives_id = movies_data['movieID']

In [42]:
# Cruce de datos
watch_data = pd.merge(user_id, moives_id, how='cross')
watch_data.head()

    userID   movieID
0  1002331  80192187
1  1002331  80210920
2  1002331  81157374
3  1002332  80192187
4  1002332  80210920

In [47]:
import random
from datetime import datetime, timedelta

def gen_rating():
    numero_aleatorio = round(random.uniform(0,5), 1)
    return numero_aleatorio

def get_timestamp():
    start_date = datetime(2024, 1, 25)
    end_date = datetime(2024, 4, 6)

    random_date = start_date + timedelta(seconds=random.randint(0, int((end_date-start_date).total_seconds())))

    return random_date

In [48]:

watch_data['rating'] = watch_data['movieID'].apply(lambda x: gen_rating())

watch_data['timestamp'] = watch_data['userID'].apply(lambda x: get_timestamp())

In [50]:
watch_data.head()

    userID   movieID  rating           timestamp
0  1002331  80192187     3.1 2024-01-25 13:22:12
1  1002331  80210920     3.5 2024-03-10 00:27:48
2  1002331  81157374     3.9 2024-01-25 13:33:22
3  1002332  80192187     4.4 2024-03-27 11:10:01
4  1002332  80210920     3.6 2024-03-06 15:24:56

In [51]:
watch_data.to_sql('FactWatchs', conn, if_exists='append', index=False)

60

In [52]:
watch_load = pd.read_sql('FactWatchs', conn)
watch_load

      userID   movieID  rating           timestamp
0    1002331  80192187     3.1 2024-01-25 13:22:12
1    1002331  80210920     3.5 2024-03-10 00:27:48
2    1002331  81157374     3.9 2024-01-25 13:33:22
3    1002332  80192187     4.4 2024-03-27 11:10:01
4    1002332  80210920     3.6 2024-03-06 15:24:56
5    1002332  81157374     2.3 2024-04-01 14:10:33
6    1002333  80192187     3.5 2024-03-24 02:40:22
7    1002333  80210920     3.1 2024-02-14 17:44:19
8    1002333  81157374     2.9 2024-02-24 21:30:35
9    1002334  80192187     3.4 2024-02-02 03:28:27
10   1002334  80210920     1.1 2024-03-10 21:39:48
11   1002334  81157374     1.1 2024-02-17 23:50:48
12   1002335  80192187     4.2 2024-02-17 23:19:20
13   1002335  80210920     1.3 2024-02-01 11:47:54
14   1002335  81157374     3.1 2024-03-11 18:11:40
15   1002336  80192187     4.3 2024-02-14 17:15:38
16   1002336  80210920     1.5 2024-04-04 01:54:06
17   1002336  81157374     3.7 2024-01-29 06:16:53
18   1002337  80192187     4.7 2024-02-19 12:25:01
19   1002337  80210920     4.9 2024-02-09 07:50:13
20   1002337  81157374     2.8 2024-04-03 16:34:27
21   1002338  80192187     2.6 2024-01-25 08:03:07
22   1002338  80210920     0.9 2024-01-28 17:03:26
23   1002338  81157374     1.8 2024-03-04 21:29:23
24   1002339  80192187     4.0 2024-03-03 23:38:31
25   1002339  80210920     3.9 2024-03-24 10:10:30
26   1002339  81157374     2.0 2024-03-25 18:08:17
27  10023310  80192187     1.4 2024-03-20 05:25:22
28  10023310  80210920     1.2 2024-02-10 17:27:02
29  10023310  81157374     0.3 2024-02-18 10:59:26
30  10023311  80192187     0.9 2024-03-26 05:25:49
31  10023311  80210920     2.9 2024-03-27 05:02:37
32  10023311  81157374     2.3 2024-03-04 09:43:51
33  10023312  80192187     1.8 2024-03-07 01:18:56
34  10023312  80210920     1.5 2024-04-03 08:38:28
35  10023312  81157374     3.0 2024-03-26 00:52:20
36  10023313  80192187     1.3 2024-02-22 06:19:10
37  10023313  80210920     3.5 2024-02-08 11:38:01
38  10023313  81157374     3.0 2024-03-09 11:52:50
39  10023314  80192187     2.6 2024-03-26 00:02:31
40  10023314  80210920     1.0 2024-03-16 13:05:34
41  10023314  81157374     2.4 2024-03-03 07:42:07
42  10023315  80192187     1.2 2024-04-02 12:35:14
43  10023315  80210920     0.8 2024-03-12 13:46:08
44  10023315  81157374     2.2 2024-02-06 19:02:01
45  10023316  80192187     4.9 2024-02-14 17:25:13
46  10023316  80210920     2.3 2024-03-24 21:00:45
47  10023316  81157374     1.2 2024-03-09 02:20:40
48  10023317  80192187     3.8 2024-03-10 21:43:16
49  10023317  80210920     3.2 2024-03-03 16:49:02
50  10023317  81157374     0.6 2024-03-18 09:38:21
51  10023318  80192187     3.4 2024-01-29 17:16:32
52  10023318  80210920     3.2 2024-01-28 16:31:22
53  10023318  81157374     3.4 2024-03-16 08:27:03
54  10023319  80192187     4.1 2024-02-17 05:58:02
55  10023319  80210920     3.4 2024-02-20 11:55:33
56  10023319  81157374     0.7 2024-03-14 21:02:46
57  10023320  80192187     3.9 2024-03-20 01:20:50
58  10023320  80210920     4.6 2024-04-05 14:41:24
59  10023320  81157374     1.5 2024-03-08 08:03:35